# SetImageCropObject

## Description
By given image handle and crop handle, set the crop to the image.

```pascal
FUNCTION SetImageCropObject(
				image : HANDLE;
				crop  : HANDLE) : BOOLEAN;
```

```python

def vs.SetImageCropObject(image, crop):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|image|HANDLE||
|crop|HANDLE||

## Returns
Returns TRUE if the cropping is successful.

## Version
Availability: from Vectorworks 2014
## Category
* Textures